In [1]:
import pandas as pd
import numpy as np

In [4]:
s=pd.Series(np.arange(5), index=["e", "d", "a","b", "c"])
##s

e    0
d    1
a    2
b    3
c    4
dtype: int32

In [5]:
#goes to ascending order

s.sort_index()

a    2
b    3
c    4
d    1
e    0
dtype: int32

In [11]:
df=pd.DataFrame(np.arange(12).reshape(3,4), index=["one", "two", "three"], columns=["d", "a","b","c"])
df

       d  a   b   c
one    0  1   2   3
two    4  5   6   7
three  8  9  10  11

In [13]:
df.sort_index()

       d  a   b   c
one    0  1   2   3
three  8  9  10  11
two    4  5   6   7

In [17]:
df.sort_index(axis=1)

       a   b   c  d
one    1   2   3  0
two    5   6   7  4
three  9  10  11  8

In [19]:
df.sort_index(axis=1, ascending=False)

       d   c   b  a
one    0   3   2  1
two    4   7   6  5
three  8  11  10  9

In [22]:
#to use Nna we use np.Nan
s2=pd.Series([5, np.nan,3,-1,9])
s2

0    5.0
1    NaN
2    3.0
3   -1.0
4    9.0
dtype: float64

In [24]:
s2.sort_values()

3   -1.0
2    3.0
0    5.0
4    9.0
1    NaN
dtype: float64

In [26]:
df2=pd.DataFrame({"a":[5,3,-1,9], "b":[1,-2,0,-5]})
df2

   a  b
0  5  1
1  3 -2
2 -1  0
3  9 -5

In [27]:
df2.sort_values(by="b")

   a  b
3  9 -5
1  3 -2
2 -1  0
0  5  1

In [29]:
df2

   a  b
0  5  1
1  3 -2
2 -1  0
3  9 -5

In [33]:
df2.sort_values(by=["b","a"])

   a  b
3  9 -5
1  3 -2
2 -1  0
0  5  1